DELETE FROM meals;
DELETE FROM user_roles;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO meals (datetime, description, calories, user_id)
VALUES ('2020-01-30 10:00', 'Завтрак Юзер', 500, 100000),
       ('2020-01-30 13:00', 'Обед Юзер', 1000, 100000),
       ('2020-01-30 20:00', 'Ужин Юзер', 500, 100000),
       ('2020-01-31 00:00', 'Еда на граничное значение Юзер', 100, 100000),
       ('2020-01-31 10:00', 'Завтрак Юзер', 1000, 100000),
       ('2020-01-31 13:00', 'Обед Юзер', 500, 100000),
       ('2020-01-31 20:00', 'Ужин Юзер', 410, 100000),
       ('2020-01-30 10:00', 'Завтрак Админ', 500, 100001),
       ('2020-01-30 13:00', 'Обед Админ', 1000, 100001),
       ('2020-01-30 20:00', 'Ужин Админ', 500, 100001),
       ('2020-01-31 00:00', 'Еда на граничное значение Админ', 100, 100001),
       ('2020-01-31 10:00', 'Завтрак Админ', 1000, 100001),
       ('2020-01-31 13:00', 'Обед Админ', 500, 100001),
       ('2020-01-31 20:00', 'Ужин Админ', 410, 100001);

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);
